#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["se-services"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"da8057937116f6934427fdf8be634de4de40c3f4a106bf6eebf519bf4fb27c19\"" -> "W/\"9064ca8da0eb76e4de1be6cd33b4c90d2ea248969f66f80541c2364eb4aaaf6c\""
        id            = "se-services:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository["tool-simulation"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"938207931ed08a401cd0873d15f7491dd978fa0ab58a17355f3a6fd98841525c\"" -> "W/\"1840a1201413ecfd4d65a7656dc4b2c0219b7cb1038ae0664ee5542d3864d05f\""
        id            = "tool-simulation:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"322ee9856d490f692883d177e02eee419adfe5564f50c41d129a5e92d02fed94\"" -> "W/\"b921d1839d7baccd403de4f9b817a91e52ec3603e540c80b470e76dd0114a32e\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"3072ac8618b54808b8fb13b375d5766dc284d0d9ce79110fe75560a2d73e8725\"" -> "W/\"50e7814ba46d065172b7d257adce1e4e700e4887ffed8358b0d4de198a5068e1\""
        id            = "lib-template-rust:develop"
      ~ sha           = "8cf214984ab669adb12d19d3e990129a2dc588ef" -> "152c12404fc2c661acf8760d17ab23860cb1d657"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"db84c2d72c32ea3ca85c35266c97e7d0e43aa9f491a22147113f870705d394f8\"" -> "W/\"6408d042fdc132e78ac8e988edf20d01899bab138cc9880db751a99e4c48a23d\""
        id            = "lib-router:develop"
      ~ sha           = "2cf47c4d462a5d009c6ddb9223c7a5ce4d49c30c" -> "0b4335a9552896d35b2d35ce3816def23dd61fb6"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"4f56ed1f0270bd6f9778d4469a2eec3bf1cec010ce69989cebefbd634910597c\"" -> "W/\"df46690154246039a9cf6d2c43852fa9382dc94248824a580967694cb68cd2fb\""
        id            = "svc-cargo:develop"
      ~ sha           = "44358d434d1de708808375f2b709db27bb72cd76" -> "5bae5af7606f9c138b0d8d6ef6f57b148217cdb0"
        # (4 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"18f73c472e25d7f1a0f1c27c7b39c13165bf021703cd0c87a9bb4f8d332c0b7f\"" -> "W/\"60ad318a2135c09952b5c5cb0940d048a2d81a2b760399e82d0a025102b51dd5\""
        id            = "svc-scheduler:develop"
      ~ sha           = "c0f37d062ae877659e812f1fecbf01a87c99d4d8" -> "045fa502231bd661be932f81de1f2dc3161dfc17"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"3288e75bf91c3c3cfc631b8c52dbaec8552c3dcdf12a4f8eff55a56f2b309327\"" -> "W/\"d111d900c53768b6d3ef60efde4814ee5bb73ee43fd025206e840bcbfaccbfab\""
        id            = "svc-storage:develop"
      ~ sha           = "1f6bcebad5e4da8b02324850ccac73826d5c9f0a" -> "c3b019e00d5f3d00a9188628b483f21123b6f3a3"
        # (5 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"9c54ecafc06db663d479e53067e440e101f92d29bac7b56ab8b2b51c1d3391c8\"" -> "W/\"45add6ee9fb48fb5bfd4c28a202a8e59c1b0b042d571406599f73201ab39b88c\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"cbc0adf5451405cf9232cebf13fa301088a8a1ed6495d5c6067e858c3b7175a3\"" -> "W/\"52a0e0c8120fb2f62271b1e08fe50b8da64593da7f2a6806ae2d818fa6c2e89a\""
        id            = "svc-template-rust:develop"
      ~ sha           = "2b8c5efc5b098a8de0957c80af5e1a126beba644" -> "3f0d6855113024db78f89827890be1305a15a028"
        # (5 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"32f6d33ce291e5cf66c8cdfd3aa017cde26e8f7d02a179f65f36b76fca933acd\"" -> "W/\"7fb9d554bca72d38d7e9717b240aabf01eb711d1c7a83ed73da3c4d14c119e17\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHzRWt84Bqv9O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZp"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup88"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup8-"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_aGzM4Bu98o"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_aGzM4Bu98q"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-pricing"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-pricing"
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.all["svc-pricing"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-pricing"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-pricing"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-pricing"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["pricing"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrow Service - Module for Pricing Flight Services"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "svc-pricing"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + template {
          + owner      = "Arrow-air"
          + repository = "svc-template-rust"
        }
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            NC=$(tput setaf 9)
            BOLD=$(tput bold)
            SGR0=$(tput sgr0)
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${SGR0}"
            
            set -e
            
            # RUST
            make rust-test
            
            # PYTHON 3
            make python-test
            
            # TOML formatting
            make toml-test
            
            # Style Check
            make editorconfig-test
            
            # Spell Check
            make cspell-test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${SGR0}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
              "-Wmissing_docs",
              "-Wmissing_debug_implementations",
              "-Wmissing_copy_implementations",
              "-Wtrivial_casts",
              "-Wtrivial_numeric_casts",
              "-Wunsafe_code",
              "-Wunstable_features",
              "-Wunused_import_braces",
              "-Wunused_qualifications",
            ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignorePaths:
              - './.cspell.project-words.txt'
              - '**/vscode-extension/**'
              - '**/.git/**'
              - '**/target/**'
              - '.vscode'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [{*.yml,*.yaml,*.toml}]
            indent_size = 2
            [Makefile*]
            indent_style = tab
            indent_size = 4
            
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".github/workflows/pr_rebase.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            name: PR Rebase
            
            env:
              TERM: xterm
            
            on:
              issue_comment:
                types: [created]
            
            jobs:
              rebase:
                name: Rebase
                if: >-
                  github.event.issue.pull_request != '' &&
                  (
                    contains(github.event.comment.body, '/autosquash') ||
                    contains(github.event.comment.body, '/fixup') ||
                    contains(github.event.comment.body, '/rebase')
                  )
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
                  contents: write
                steps:
                  - name: Checkout the latest code
                    uses: actions/checkout@v3
                    with:
                      token: ${{ secrets.GITHUB_TOKEN }}
                      fetch-depth: 0 # otherwise, you will fail to push refs to dest repo
                  - name: Automatic Rebase
                    uses: cirrus-actions/rebase@1.7
                    with:
                      autosquash: ${{ true }}
                    env:
                      GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
        EOT
      + file                = ".github/workflows/pr_rebase.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            env:
              TERM: xterm
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make python-test
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              TERM: xterm
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - name: Build
                    run: make build
                  - name: Test
                    run: make rust-test
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-fmt
            
              clippy:
                name: Clippy
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-clippy
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              toml:
                name: TOML format check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make toml-test
            
              cspell:
                name: Spelling check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            # Local cargo cache generated by make targets
            .cargo/registry
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
            
            # Don't add vscode meta files
            .vscode
            
            # Don't add DS_Store
            .DS_Store
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".taplo.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            exclude = ["**/.cargo/registry/**"]
            
            [formatting]
            reorder_keys  = false
            align_entries = true
            
            [[rule]]
            include = ["**/Cargo.toml"]
            keys = [
              "dependencies",
              "dev-dependencies",
              "build-dependencies",
              "target",
              "package",
              "workspace",
              "profile",
              "replace",
              "patch",
              "features",
              "badges",
            ]
            
            [rule.formatting]
            reorder_keys = true
        EOT
      + file                = ".taplo.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-pricing
            IMAGE_NAME       := lib-pricing
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            
            DOCKER_PORT      := 8080
            HOST_PORT        := 8001
            
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	-e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
            	-e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
            	-v "$(PWD):/usr/src/app" \
            	-v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
            	$(2) \
            	-t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
            	$(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null |"
            	@echo "                      sort -f >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release docker-build"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)-- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run' to stop our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            .SILENT: check-cargo-registry docker-pull
            
            docker-pull:
            	@docker pull -q $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG)
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry docker-pull
            	@$(call cargo_run,build)
            
            release: docker-pull
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish: docker-pull
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry docker-pull
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry docker-pull
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry docker-pull
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry docker-pull
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry docker-pull
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry docker-pull
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test: docker-pull
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy: docker-pull
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test: docker-pull
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy: docker-pull
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test: docker-pull
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words: docker-pull
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            # Docker targets
            docker-build: docker-pull
            	@docker build --build-arg PACKAGE_NAME --tag $(IMAGE_NAME):latest ../
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
            	@docker run --rm -d -p $(HOST_PORT):$(DOCKER_PORT) --name=$(DOCKER_NAME)-run $(IMAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT)$(NC)"
            
            docker-stop:
            	@docker kill $(DOCKER_NAME)-run || true
            
            all: test build release docker-build
            
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "svc-pricing"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_rust_svc["pricing"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "svc-pricing"
      + team_id    = "services"
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-scheduler
            IMAGE_NAME       := lib-scheduler
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            
            DOCKER_PORT      := 8080
          - HOST_PORT        := 8001
          + HOST_PORT        := 8002
            
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	-e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
            	-e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
            	-v "$(PWD):/usr/src/app" \
            	-v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
            	$(2) \
            	-t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
            	$(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null |"
            	@echo "                      sort -f >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release docker-build"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)-- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run' to stop our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            .SILENT: check-cargo-registry docker-pull
            
            docker-pull:
            	@docker pull -q $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG)
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry docker-pull
            	@$(call cargo_run,build)
            
            release: docker-pull
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish: docker-pull
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry docker-pull
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry docker-pull
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry docker-pull
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry docker-pull
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry docker-pull
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry docker-pull
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test: docker-pull
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy: docker-pull
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test: docker-pull
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy: docker-pull
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test: docker-pull
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words: docker-pull
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            # Docker targets
            docker-build: docker-pull
            	@docker build --build-arg PACKAGE_NAME --tag $(IMAGE_NAME):latest ../
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
            	@docker run --rm -d -p $(HOST_PORT):$(DOCKER_PORT) --name=$(DOCKER_NAME)-run $(IMAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT)$(NC)"
            
            docker-stop:
            	@docker kill $(DOCKER_NAME)-run || true
            
            all: test build release docker-build
            
        EOT
        id                  = "svc-scheduler/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-storage
            IMAGE_NAME       := lib-storage
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            
            DOCKER_PORT      := 8080
          - HOST_PORT        := 8002
          + HOST_PORT        := 8003
            
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	-e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
            	-e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
            	-v "$(PWD):/usr/src/app" \
            	-v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
            	$(2) \
            	-t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
            	$(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null |"
            	@echo "                      sort -f >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release docker-build"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)-- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run' to stop our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            .SILENT: check-cargo-registry docker-pull
            
            docker-pull:
            	@docker pull -q $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG)
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry docker-pull
            	@$(call cargo_run,build)
            
            release: docker-pull
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish: docker-pull
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry docker-pull
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry docker-pull
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry docker-pull
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry docker-pull
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry docker-pull
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry docker-pull
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test: docker-pull
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy: docker-pull
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test: docker-pull
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy: docker-pull
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test: docker-pull
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words: docker-pull
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            # Docker targets
            docker-build: docker-pull
            	@docker build --build-arg PACKAGE_NAME --tag $(IMAGE_NAME):latest ../
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
            	@docker run --rm -d -p $(HOST_PORT):$(DOCKER_PORT) --name=$(DOCKER_NAME)-run $(IMAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT)$(NC)"
            
            docker-stop:
            	@docker kill $(DOCKER_NAME)-run || true
            
            all: test build release docker-build
            
        EOT
        id                  = "svc-storage/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 22 to add, 28 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ se-services     = {
          ~ branch         = {
              ~ develop = {
                  ~ etag          = "W/\"da8057937116f6934427fdf8be634de4de40c3f4a106bf6eebf519bf4fb27c19\"" -> "W/\"9064ca8da0eb76e4de1be6cd33b4c90d2ea248969f66f80541c2364eb4aaaf6c\""
                    id            = "se-services:develop"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ tool-simulation = {
          ~ branch         = {
              ~ develop = {
                  ~ etag          = "W/\"938207931ed08a401cd0873d15f7491dd978fa0ab58a17355f3a6fd98841525c\"" -> "W/\"1840a1201413ecfd4d65a7656dc4b2c0219b7cb1038ae0664ee5542d3864d05f\""
                    id            = "tool-simulation:develop"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ website         = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"322ee9856d490f692883d177e02eee419adfe5564f50c41d129a5e92d02fed94\"" -> "W/\"b921d1839d7baccd403de4f9b817a91e52ec3603e540c80b470e76dd0114a32e\""
                    id            = "website:staging"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (4 unchanged elements hidden)
    }

```

</details>

*Pusher: @GoodluckH, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*